Repository: kwccoin/telegram_big_two_bot
Catalog: locale/*/LC_MESSAGES/big_two_text.po
Languages: it

source: Welcome to Big Two Moderator. Add me into a group and type /startgame to start a game. You can also type /setlang to change the bot's language. Please note that you can only use /setlang for changing the bot's language in a group if you are a group admin.
it: Benvenuto/a in Big Two Moderator. Aggiungimi ad un gruppo e digita /startgame per iniziare una partita. Puoi anche digitare /setlang per cambiare la lingua del bot. Nota che puoi utilizzare /setlang per cambiare la lingua del bot in un gruppo, soltanto se sei admin del gruppo in questione.

source: Add me into a group and type /startgame to start a game. Other players can then type /join to join the game. You will not be able to start or join a game if a game has already been set up and running. You can only force to stop a game if you are a group admin. Use /command to get a list of commands to see what I can do.
it: Aggiungimi in un gruppo e digita /startgame per iniziare una partita. Gli altri giocatori possono usare /join per unirsi alla partita. Non sarai in grado di avviare o unirti ad una partita nel caso in cui sia già stata iniziata e in corso. Puoi forzare l'interruzione di una partita solo sei admin del gruppo. Usa /command per ottenere una lista dei comandi e per vedere quello che posso fare.

source: /setlang - Set your or the group's bot language /setjointimer <timer> - Set the timer for joining the game (e.g. /setjointimer 30) /setpasstimer <timer> - Set the timer for automatic pass (e.g. /setpasstimer 30) /startgame - Start a new game /join - Join a game /forcestop - Force to stop a game /showdeck - Show your deck of cards /help - How to use the bot /donate - Support my developer!
it: /setlang - Imposta la tua lingua o quella del gruppo /setjointimer <timer> - Imposta il timer per unirsi alla partita (es. /setjointimer 30) /setpasstimer <timer> - Imposta il timer per il pass automatico (es. /setpasstimer 30) /startgame - Inizia una nuova partita /join - Unisciti ad una partita /forcestop - Interrompi una partita /showdeck - Mostra le tue carte /help - Come usare il bot /donate - Supporta il mio sviluppatore!

source: Want to help keep me online? Please donate to %s through PayPal. Donations help me to stay on my server and keep running.
it: Vuoi aiutarmi a restare online? Per favore, dona a %s tramite PayPal. Le donazioni mi aiutano a restare sul mio server e a funzionare.

source: Pick your default language from below
it: Seleziona la tua lingua di default:

source: Pick the group's default language from below
it: Seleziona la lingua di default del gruppo:

source: You are not a group admin
it: Non sei un admin del gruppo

source: You can only use this command in a group
it: Puoi usare questo comando solo in un gruppo

source: You can only change the group's settings when a game is not running
it: Puoi modificare le impostazioni del gruppo solo quando non ci sono partite in corso

source: Game mode can either be set to 'normal' or 'money'
it: La modalità di gioco può essere impostata su 'normal' o 'money'

source: Game mode has been set to '%s'
it: La modalità di gioco è stata impostata su '%s'

source: Join timer can only be set between 10s to 180s
it: Il timer per joinare può essere impostato solo da 10s a 180s

source: Pass timer can only be set between 20s to 120s
it: Il timer per passare può essere impostato solo da 20s a 120s

source: Join timer has been set to %ds
it: Il timer per joinare è stato impostato a %ds

source: Pass timer has been set to %ds
it: Il timer per passare è stato impostato a %ds

source: A game has already been started
it: Una partita è già stata iniziata

source: [%s] has started Big Two. Type /join to join the game
it: [%s] ha avviato Big Two. Digita /join per unirti alla partita

source: [%s] Please PM [@biggytwobot] and say [/start]. Otherwise, you won't be able to join and play Big Two
it: Per favore, contatta [@BiggyTwoBot] e usa /start. In caso contrario, non sarai in grado di giocare a Big Two

source: Say start to me
it: Avviami in privato

source: A game has not been started yet. Type /startgame in a group to start a game.
it: Nessuna partita è ancora stata avviata. Digita /startgame in un gruppo per avviarla.

source: You have already joined a game
it: Ti sei già unito/a ad una partita

source: You don't have any money left to join the game.
it: Non hai più soldi per unirti alla partita.

source: You can consider to buy me a /coffee to recharge your money immediately.
it: Puoi pensare di offrirmi un /coffee per ricaricare i tuoi soldi immediatamente.

source: Or wait for your money to be recharged %s.
it: O aspettare che i tuoi soldi vengano ricaricati %s.

source: [%s] has joined. There are now %d/4 Players
it: [%s] si è unito/a. Sono presenti %d/4 giocatori

source: %ss left to join
it: %ss rimanenti per unirsi

source: You have joined the game in the group [%s]
it: Ti sei unito/a alla partita nel gruppo [%s]

source: Enough players, game start. I will PM your deck of cards when it is your turn.
it: Giocatori sufficienti, la partita ha inizio. Invierò le tue carte in privato quando sarà il tuo turno.

source: Each player has %ss to pick your cards
it: Ogni giocatore ha %ss per prendere le tue carte

source: Game has been stopped by me since there is no enough players.
it: La partita è stata annullata dal momento che non ci sono abbastanza giocatori.

source: %s decided to PASS
it: %s PASSA

source: %s's Turn
it: Turno di: %s

source: Selected cards:
it: Carte selezionate:

source: Unselect
it: Annulla

source: Done
it: Fatto

source: Sort by number
it: Ordina per numero

source: PASS
it: PASSA

source: Sort by suit
it: Ordina per seme

source: %s has %d cards
it: %s ha %d carte

source: %s is in control now
it: %s ha ora il controllo.

source: %s used:
it: %s ha utilizzato:

source: No game is running at the moment
it: Nessuna partita in corso in questo momento

source: Game has been stopped by [%s]
it: La partita è stata interrotta da [%s]

source: You are not in a game
it: Non sei in una partita

source: Game has not started yet
it: La partita non è ancora iniziata

source: Your deck of cards:
it: Le tue carte:

source: Default language has been set
it: La lingua di default è stata impostata

source: Invalid cards. Please try again
it: Carte non valide. Riprova

source: You cards are not bigger than the previous cards.
it: Le tue carte non sono più alte delle precedenti.

source: Please try again
it: Riprova per favore

source: These cards have been used:
it: Carte utilizzate:

source: I have passed all players since %s has used ♠ 2
it: Ho passato tutti i giocatori dato che %s ha usato il ♠️ 2

source: You won!
it: Hai vinto!

source: You lost!
it: Hai perso!

source: %s won!
it: %s ha vinto!

source: You Passed
it: Hai passato

source: Game has been stopped by me since no one is playing
it: La partita è stata interrotta dal momento che nessuno sta giocando

source: You still have $%d left.
it: Hai ancora a disposizione %d$.

source: Thanks for the coffee! Enjoy Big 2!
it: Grazie per il caffè! Divertiti con Big 2!

source: Your money has been recharged
it: I tuoi soldi sono stati ricaricati

source: Please send me your feedback or type /cancel to cancel this operation. My developer can understand English and Chinese.
it: Per favore, inviami il tuo feedback o digita /cancel per annullare questa operazione. Il mio sviluppatore può comprendere l'inglese e il cinese.

source: The feedback you sent is not in English or Chinese. Please try again.
it: Il tuo feedback non è in lingua inglese o cinese. Riprova per favore.

source: Thank you for your feedback, I will let my developer know.
it: Grazie per il tuo feedback, lo farò sapere al mio sviluppatore.

source: Operation cancelled.
it: Operazione annullata.
